zejun051019/2026-NUEDC-H-MSPM0G3507/include/core/ti/devices/msp/peripherals/hw_mcan.h
/*****************************************************************************

  Copyright (C) 2023 Texas Instruments Incorporated - http://www.ti.com/

  Redistribution and use in source and binary forms, with or without
  modification, are permitted provided that the following conditions
  are met:

   Redistributions of source code must retain the above copyright
   notice, this list of conditions and the following disclaimer.

   Redistributions in binary form must reproduce the above copyright
   notice, this list of conditions and the following disclaimer in the
   documentation and/or other materials provided with the
   distribution.

   Neither the name of Texas Instruments Incorporated nor the names of
   its contributors may be used to endorse or promote products derived
   from this software without specific prior written permission.

  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
  "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
  LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
  A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT
  OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
  SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
  LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
  DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
  THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
  (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.

*****************************************************************************/

/**
 * @file hw_mcan.h
 * @brief MCAN (CAN-FD 控制器) 硬件寄存器定义
 *
 * 本文件定义了 MSPM0G3507 微控制器中 MCAN 模块的全部寄存器和位域。
 * MCAN 支持 CAN 2.0 和 CAN-FD 协议，主要特性包括：
 * - 支持经典 CAN 帧和 CAN-FD 帧
 * - 可配置的标称位时间和数据位时间
 * - 标准/扩展 ID 消息过滤
 * - 双接收 FIFO (RXF0/RXF1)
 * - 发送缓冲区/FIFO/队列
 * - 发送事件 FIFO
 * - ECC 错误检测与纠正
 * - 时间戳和超时计数器
 */

#ifndef ti_devices_msp_peripherals_hw_mcan__include
#define ti_devices_msp_peripherals_hw_mcan__include

/* Filename: hw_mcan.h */
/* Revised: 2023-06-13 16:25:08 */
/* Revision: 80c507b5f57e662daefb523742741547f0b08eb5 */

#ifndef __CORTEX_M
  #ifdef __cplusplus
    #define __I  volatile        /*!< Defines 'read only' permissions */
  #else
    #define __I  volatile const  /*!< Defines 'read only' permissions */
  #endif
  #define __O  volatile          /*!< Defines 'write only' permissions */
  #define __IO  volatile         /*!< Defines 'read / write' permissions */

  /* following defines should be used for structure members */
  #define __IM  volatile const   /*! Defines 'read only' structure member permissions */
  #define __OM  volatile         /*! Defines 'write only' structure member permissions */
  #define __IOM  volatile        /*! Defines 'read / write' structure member permissions */
#endif

/* Use standard integer types with explicit width */
#include <stdint.h>

#ifdef __cplusplus
 extern "C" {
#endif

#if defined ( __CC_ARM )
#pragma anon_unions
#endif

/******************************************************************************
* MCAN Registers - MCAN 寄存器定义
******************************************************************************/

/* 各寄存器组基地址偏移 */
#define MCAN_CPU_INT_OFS                         ((uint32_t)0x00007820U)  /* CPU中断寄存器偏移 */
#define MCAN_MSP_OFS                             ((uint32_t)0x00007800U)  /* MSP寄存器偏移 */
#define MCAN_ECC_REGS_OFS                        ((uint32_t)0x00007400U)  /* ECC寄存器偏移 */
#define MCAN_REGS_OFS                            ((uint32_t)0x00007200U)  /* 子系统寄存器偏移 */
#define MCAN_PROCESSORS_OFS                      ((uint32_t)0x00007200U)  /* 处理器寄存器偏移 */
#define MCAN_TI_WRAPPER_OFS                      ((uint32_t)0x00007200U)  /* TI封装寄存器偏移 */
#define MCAN_MCAN_OFS                            ((uint32_t)0x00007000U)  /* MCAN核心寄存器偏移 */
#define MCAN_MCANSS_OFS                          ((uint32_t)0x00006000U)  /* MCAN子系统寄存器偏移 */


/** @addtogroup MCAN_CPU_INT
  @{
*/

/* CPU 中断控制寄存器组 */
typedef struct {
  __I  uint32_t IIDX;                              /* !< (@ 0x00007820) 中断索引寄存器（指示当前最高优先级中断） */
       uint32_t RESERVED0;
  __IO uint32_t IMASK;                             /* !< (@ 0x00007828) 中断屏蔽寄存器 */
       uint32_t RESERVED1;
  __I  uint32_t RIS;                               /* !< (@ 0x00007830) 原始中断状态寄存器 */
       uint32_t RESERVED2;
  __I  uint32_t MIS;                               /* !< (@ 0x00007838) 屏蔽后中断状态寄存器 */
       uint32_t RESERVED3;
  __O  uint32_t ISET;                              /* !< (@ 0x00007840) 中断置位寄存器（写1触发中断） */
       uint32_t RESERVED4;
  __O  uint32_t ICLR;                              /* !< (@ 0x00007848) 中断清除寄存器（写1清除中断） */
} MCAN_CPU_INT_Regs;

/*@}*/ /* end of group MCAN_CPU_INT */

/** @addtogroup MCAN_MSP
  @{
*/

/* MSP (混合信号处理器) 控制寄存器组 */
typedef struct {
       uint32_t RESERVED0[8];
  MCAN_CPU_INT_Regs  CPU_INT;                           /* !< (@ 0x00007820) CPU中断控制寄存器 */
       uint32_t RESERVED1[37];
  __IO uint32_t EVT_MODE;                          /* !< (@ 0x000078E0) 事件模式配置 */
       uint32_t RESERVED2[6];
  __I  uint32_t DESC;                              /* !< (@ 0x000078FC) 模块描述寄存器 */
  __IO uint32_t MCANSS_CLKEN;                      /* !< (@ 0x00007900) MCAN模块时钟使能 */
  __IO uint32_t MCANSS_CLKDIV;                     /* !< (@ 0x00007904) 时钟分频器 */
  __IO uint32_t MCANSS_CLKCTL;                     /* !< (@ 0x00007908) MCAN子系统时钟停止控制 */
  __I  uint32_t MCANSS_CLKSTS;                     /* !< (@ 0x0000790C) MCAN子系统时钟停止状态 */
} MCAN_MSP_Regs;

/*@}*/ /* end of group MCAN_MSP */

/** @addtogroup MCAN_ECC_REGS
  @{
*/

/* ECC (纠错码) 寄存器组 - 用于RAM错误检测与纠正 */
typedef struct {
  __I  uint32_t MCANERR_REV;                       /* !< (@ 0x00007400) 错误聚合器版本寄存器 */
       uint32_t RESERVED0;
  __IO uint32_t MCANERR_VECTOR;                    /* !< (@ 0x00007408) ECC向量寄存器（指示错误位置） */
  __I  uint32_t MCANERR_STAT;                      /* !< (@ 0x0000740C) 错误杂项状态 */
  __I  uint32_t MCANERR_WRAP_REV;                  /* !< (@ 0x00007410) ECC封装版本寄存器 */
  __IO uint32_t MCANERR_CTRL;                      /* !< (@ 0x00007414) ECC控制寄存器 */
  __IO uint32_t MCANERR_ERR_CTRL1;                 /* !< (@ 0x00007418) ECC错误控制寄存器1 */
  __IO uint32_t MCANERR_ERR_CTRL2;                 /* !< (@ 0x0000741C) ECC错误控制寄存器2 */
  __IO uint32_t MCANERR_ERR_STAT1;                 /* !< (@ 0x00007420) ECC错误状态寄存器1 */
  __I  uint32_t MCANERR_ERR_STAT2;                 /* !< (@ 0x00007424) ECC错误状态寄存器2 */
  __IO uint32_t MCANERR_ERR_STAT3;                 /* !< (@ 0x00007428) ECC错误状态寄存器3 */
       uint32_t RESERVED1[4];
  __IO uint32_t MCANERR_SEC_EOI;                   /* !< (@ 0x0000743C) 单位错误纠正中断结束寄存器 */
  __IO uint32_t MCANERR_SEC_STATUS;                /* !< (@ 0x00007440) 单位错误纠正中断状态寄存器 */
       uint32_t RESERVED2[15];
  __IO uint32_t MCANERR_SEC_ENABLE_SET;            /* !< (@ 0x00007480) 单位错误纠正中断使能置位 */
       uint32_t RESERVED3[15];
  __IO uint32_t MCANERR_SEC_ENABLE_CLR;            /* !< (@ 0x000074C0) 单位错误纠正中断使能清除 */
       uint32_t RESERVED4[30];
  __IO uint32_t MCANERR_DED_EOI;                   /* !< (@ 0x0000753C) 双位错误检测中断结束寄存器 */
  __IO uint32_t MCANERR_DED_STATUS;                /* !< (@ 0x00007540) 双位错误检测中断状态寄存器 */
       uint32_t RESERVED5[15];
  __IO uint32_t MCANERR_DED_ENABLE_SET;            /* !< (@ 0x00007580) 双位错误检测中断使能置位 */
       uint32_t RESERVED6[15];
  __IO uint32_t MCANERR_DED_ENABLE_CLR;            /* !< (@ 0x000075C0) 双位错误检测中断使能清除 */
       uint32_t RESERVED7[15];
  __IO uint32_t MCANERR_AGGR_ENABLE_SET;           /* !< (@ 0x00007600) 错误聚合器使能置位 */
  __IO uint32_t MCANERR_AGGR_ENABLE_CLR;           /* !< (@ 0x00007604) 错误聚合器使能清除 */
  __IO uint32_t MCANERR_AGGR_STATUS_SET;           /* !< (@ 0x00007608) 错误聚合器状态置位 */
  __IO uint32_t MCANERR_AGGR_STATUS_CLR;           /* !< (@ 0x0000760C) 错误聚合器状态清除 */
} MCAN_ECC_REGS_Regs;

/*@}*/ /* end of group MCAN_ECC_REGS */

/** @addtogroup MCAN_REGS
  @{
*/

/* MCAN 子系统寄存器组 */
typedef struct {
  __I  uint32_t MCANSS_PID;                        /* !< (@ 0x00007200) MCAN子系统版本寄存器 */
  __IO uint32_t MCANSS_CTRL;                       /* !< (@ 0x00007204) MCAN子系统控制寄存器 */
  __I  uint32_t MCANSS_STAT;                       /* !< (@ 0x00007208) MCAN子系统状态寄存器 */
  __IO uint32_t MCANSS_ICS;                        /* !< (@ 0x0000720C) 中断清除影子寄存器 */
  __IO uint32_t MCANSS_IRS;                        /* !< (@ 0x00007210) 原始中断状态寄存器 */
  __IO uint32_t MCANSS_IECS;                       /* !< (@ 0x00007214) 中断使能清除影子寄存器 */
  __IO uint32_t MCANSS_IE;                         /* !< (@ 0x00007218) 中断使能寄存器 */
  __I  uint32_t MCANSS_IES;                        /* !< (@ 0x0000721C) 中断使能状态寄存器 */
  __IO uint32_t MCANSS_EOI;                        /* !< (@ 0x00007220) 中断结束寄存器 */
  __IO uint32_t MCANSS_EXT_TS_PRESCALER;           /* !< (@ 0x00007224) 外部时间戳预分频器 */
  __I  uint32_t MCANSS_EXT_TS_UNSERVICED_INTR_CNTR;/* !< (@ 0x00007228) 外部时间戳未服务中断计数器 */
} MCAN_REGS_Regs;

