zejun051019/2026-NUEDC-H-MSPM0G3507/include/core/ti/devices/msp/peripherals/hw_mcan.h
/*@}*/ /* end of group MCAN_REGS */

/** @addtogroup MCAN_PROCESSORS
  @{
*/

typedef struct {
  MCAN_REGS_Regs  MCANSS_REGS;                       /* !< (@ 0x00007200) */
       uint32_t RESERVED0[117];
  MCAN_ECC_REGS_Regs  MCAN_ECC_REGS;                     /* !< (@ 0x00007400) */
} MCAN_PROCESSORS_Regs;

/*@}*/ /* end of group MCAN_PROCESSORS */

/** @addtogroup MCAN_TI_WRAPPER
  @{
*/

typedef struct {
  MCAN_PROCESSORS_Regs  PROCESSORS;                        /* !< (@ 0x00007200) */
       uint32_t RESERVED0[124];
  MCAN_MSP_Regs  MSP;                               /* !< (@ 0x00007800) */
} MCAN_TI_WRAPPER_Regs;

/*@}*/ /* end of group MCAN_TI_WRAPPER */

/** @addtogroup MCAN_MCAN
  @{
*/

/* MCAN 核心寄存器组 - 实现CAN协议的主要寄存器 */
typedef struct {
  __I  uint32_t MCAN_CREL;                         /* !< (@ 0x00007000) 核心版本寄存器 */
  __I  uint32_t MCAN_ENDN;                         /* !< (@ 0x00007004) 字节序寄存器 */
       uint32_t RESERVED0;
  __IO uint32_t MCAN_DBTP;                         /* !< (@ 0x0000700C) 数据位时间和预分频器 */
  __IO uint32_t MCAN_TEST;                         /* !< (@ 0x00007010) 测试寄存器 */
  __IO uint32_t MCAN_RWD;                          /* !< (@ 0x00007014) RAM看门狗 */
  __IO uint32_t MCAN_CCCR;                         /* !< (@ 0x00007018) CC控制寄存器（配置CAN模式） */
  __IO uint32_t MCAN_NBTP;                         /* !< (@ 0x0000701C) 标称位时间和预分频器 */
  __IO uint32_t MCAN_TSCC;                         /* !< (@ 0x00007020) 时间戳计数器配置 */
  __IO uint32_t MCAN_TSCV;                         /* !< (@ 0x00007024) 时间戳计数器值 */
  __IO uint32_t MCAN_TOCC;                         /* !< (@ 0x00007028) 超时计数器配置 */
  __IO uint32_t MCAN_TOCV;                         /* !< (@ 0x0000702C) 超时计数器值 */
       uint32_t RESERVED1[4];
  __I  uint32_t MCAN_ECR;                          /* !< (@ 0x00007040) 错误计数器寄存器 */
  __I  uint32_t MCAN_PSR;                          /* !< (@ 0x00007044) 协议状态寄存器 */
  __IO uint32_t MCAN_TDCR;                         /* !< (@ 0x00007048) 发送延迟补偿寄存器 */
       uint32_t RESERVED2;
  __IO uint32_t MCAN_IR;                           /* !< (@ 0x00007050) 中断寄存器 */
  __IO uint32_t MCAN_IE;                           /* !< (@ 0x00007054) 中断使能寄存器 */
  __IO uint32_t MCAN_ILS;                          /* !< (@ 0x00007058) 中断线选择 */
  __IO uint32_t MCAN_ILE;                          /* !< (@ 0x0000705C) 中断线使能 */
       uint32_t RESERVED3[8];
  __IO uint32_t MCAN_GFC;                          /* !< (@ 0x00007080) 全局过滤配置 */
  __IO uint32_t MCAN_SIDFC;                        /* !< (@ 0x00007084) 标准ID过滤配置 */
  __IO uint32_t MCAN_XIDFC;                        /* !< (@ 0x00007088) 扩展ID过滤配置 */
       uint32_t RESERVED4;
  __IO uint32_t MCAN_XIDAM;                        /* !< (@ 0x00007090) 扩展ID掩码 */
  __I  uint32_t MCAN_HPMS;                         /* !< (@ 0x00007094) 高优先级消息状态 */
  __IO uint32_t MCAN_NDAT1;                        /* !< (@ 0x00007098) 新数据标志1 */
  __IO uint32_t MCAN_NDAT2;                        /* !< (@ 0x0000709C) 新数据标志2 */
  __IO uint32_t MCAN_RXF0C;                        /* !< (@ 0x000070A0) 接收FIFO 0配置 */
  __I  uint32_t MCAN_RXF0S;                        /* !< (@ 0x000070A4) 接收FIFO 0状态 */
  __IO uint32_t MCAN_RXF0A;                        /* !< (@ 0x000070A8) 接收FIFO 0应答 */
  __IO uint32_t MCAN_RXBC;                         /* !< (@ 0x000070AC) 接收缓冲区配置 */
  __IO uint32_t MCAN_RXF1C;                        /* !< (@ 0x000070B0) 接收FIFO 1配置 */
  __I  uint32_t MCAN_RXF1S;                        /* !< (@ 0x000070B4) 接收FIFO 1状态 */
  __IO uint32_t MCAN_RXF1A;                        /* !< (@ 0x000070B8) 接收FIFO 1应答 */
  __IO uint32_t MCAN_RXESC;                        /* !< (@ 0x000070BC) 接收缓冲区/FIFO元素大小配置 */
  __IO uint32_t MCAN_TXBC;                         /* !< (@ 0x000070C0) 发送缓冲区配置 */
  __I  uint32_t MCAN_TXFQS;                        /* !< (@ 0x000070C4) 发送FIFO/队列状态 */
  __IO uint32_t MCAN_TXESC;                        /* !< (@ 0x000070C8) 发送缓冲区元素大小配置 */
  __I  uint32_t MCAN_TXBRP;                        /* !< (@ 0x000070CC) 发送缓冲区请求待处理 */
  __IO uint32_t MCAN_TXBAR;                        /* !< (@ 0x000070D0) 发送缓冲区添加请求 */
  __IO uint32_t MCAN_TXBCR;                        /* !< (@ 0x000070D4) 发送缓冲区取消请求 */
  __I  uint32_t MCAN_TXBTO;                        /* !< (@ 0x000070D8) 发送缓冲区传输完成 */
  __I  uint32_t MCAN_TXBCF;                        /* !< (@ 0x000070DC) 发送缓冲区取消完成 */
  __IO uint32_t MCAN_TXBTIE;                       /* !< (@ 0x000070E0) 发送缓冲区传输中断使能 */
  __IO uint32_t MCAN_TXBCIE;                       /* !< (@ 0x000070E4) 发送缓冲区取消完成中断使能 */
       uint32_t RESERVED5[2];
  __IO uint32_t MCAN_TXEFC;                        /* !< (@ 0x000070F0) 发送事件FIFO配置 */
  __I  uint32_t MCAN_TXEFS;                        /* !< (@ 0x000070F4) 发送事件FIFO状态 */
  __IO uint32_t MCAN_TXEFA;                        /* !< (@ 0x000070F8) 发送事件FIFO应答 */
} MCAN_MCAN_Regs;

/*@}*/ /* end of group MCAN_MCAN */

/** @addtogroup MCAN_MCANSS
  @{
*/

/* MCAN 子系统顶层寄存器组（包含电源/复位控制和所有子模块） */
typedef struct {
       uint32_t RESERVED0[512];
  __IO uint32_t PWREN;                             /* !< (@ 0x00006800) 电源使能寄存器 */
  __O  uint32_t RSTCTL;                            /* !< (@ 0x00006804) 复位控制寄存器 */
       uint32_t RESERVED1[3];
  __I  uint32_t STAT;                              /* !< (@ 0x00006814) 状态寄存器 */
       uint32_t RESERVED2[506];
  MCAN_MCAN_Regs  MCAN;                              /* !< (@ 0x00007000) MCAN核心寄存器 */
       uint32_t RESERVED3[65];
  MCAN_TI_WRAPPER_Regs  TI_WRAPPER;                        /* !< (@ 0x00007200) TI封装寄存器 */
} MCAN_MCANSS_Regs;

/*@}*/ /* end of group MCAN_MCANSS */

/** @addtogroup MCAN
  @{
*/

/* MCAN 外设顶层寄存器组 */
typedef struct {
       uint32_t RESERVED0[6144];
  MCAN_MCANSS_Regs  MCANSS;                            /* !< (@ 0x00006000) MCAN子系统寄存器 */
} MCAN_Regs;

/*@}*/ /* end of group MCAN */



#if defined ( __CC_ARM )
#pragma no_anon_unions
#endif

/******************************************************************************
* MCAN Register Control Bits - MCAN 寄存器控制位域
******************************************************************************/

/* MCAN_IIDX Bits */
/* MCAN_IIDX[STAT] Bits */
#define MCAN_IIDX_STAT_OFS                       (0)                             /* !< STAT Offset */
#define MCAN_IIDX_STAT_MASK                      ((uint32_t)0x000000FFU)         /* !< Interrupt index status */
#define MCAN_IIDX_STAT_NO_INTR                   ((uint32_t)0x00000000U)         /* !< No interrupt pending. */
#define MCAN_IIDX_STAT_INTL0                     ((uint32_t)0x00000001U)         /* !< MCAN Interrupt Line 0 interrupt
                                                                                    pending. */
#define MCAN_IIDX_STAT_INTL1                     ((uint32_t)0x00000002U)         /* !< MCAN Interrupt Line 1 interrupt
                                                                                    pending. */
#define MCAN_IIDX_STAT_SEC                       ((uint32_t)0x00000003U)         /* !< Message RAM SEC (Single Error
                                                                                    Correction) interrupt pending. */
#define MCAN_IIDX_STAT_DED                       ((uint32_t)0x00000004U)         /* !< Message RAM DED (Double Error
                                                                                    Detection)  interrupt pending. */
#define MCAN_IIDX_STAT_EXT_TS_CNTR_OVFL          ((uint32_t)0x00000005U)         /* !< External Timestamp Counter Overflow
                                                                                    interrupt pending. */
#define MCAN_IIDX_STAT_WAKEUP                    ((uint32_t)0x00000006U)         /* !< Clock Stop Wake Up interrupt
                                                                                    pending. */

