zejun051019/2026-NUEDC-H-MSPM0G3507/include/core/ti/devices/msp/peripherals/hw_mcan.h
/* MCAN_IMASK Bits */
/* MCAN_IMASK[INTL0] Bits */
#define MCAN_IMASK_INTL0_OFS                     (0)                             /* !< INTL0 Offset */
#define MCAN_IMASK_INTL0_MASK                    ((uint32_t)0x00000001U)         /* !< MCAN Interrupt Line 0 mask. */
#define MCAN_IMASK_INTL0_CLR                     ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define MCAN_IMASK_INTL0_SET                     ((uint32_t)0x00000001U)         /* !< Set Interrrupt Mask */
/* MCAN_IMASK[INTL1] Bits */
#define MCAN_IMASK_INTL1_OFS                     (1)                             /* !< INTL1 Offset */
#define MCAN_IMASK_INTL1_MASK                    ((uint32_t)0x00000002U)         /* !< MCAN Interrupt Line 1 mask. */
#define MCAN_IMASK_INTL1_CLR                     ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define MCAN_IMASK_INTL1_SET                     ((uint32_t)0x00000002U)         /* !< Set Interrrupt Mask */
/* MCAN_IMASK[SEC] Bits */
#define MCAN_IMASK_SEC_OFS                       (2)                             /* !< SEC Offset */
#define MCAN_IMASK_SEC_MASK                      ((uint32_t)0x00000004U)         /* !< Message RAM SEC interrupt mask. */
#define MCAN_IMASK_SEC_CLR                       ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define MCAN_IMASK_SEC_SET                       ((uint32_t)0x00000004U)         /* !< Set Interrrupt Mask */
/* MCAN_IMASK[DED] Bits */
#define MCAN_IMASK_DED_OFS                       (3)                             /* !< DED Offset */
#define MCAN_IMASK_DED_MASK                      ((uint32_t)0x00000008U)         /* !< Massage RAM DED interrupt mask. */
#define MCAN_IMASK_DED_CLR                       ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define MCAN_IMASK_DED_SET                       ((uint32_t)0x00000008U)         /* !< Set Interrrupt Mask */
/* MCAN_IMASK[EXT_TS_CNTR_OVFL] Bits */
#define MCAN_IMASK_EXT_TS_CNTR_OVFL_OFS          (4)                             /* !< EXT_TS_CNTR_OVFL Offset */
#define MCAN_IMASK_EXT_TS_CNTR_OVFL_MASK         ((uint32_t)0x00000010U)         /* !< External Timestamp Counter Overflow
                                                                                    interrupt mask. */
#define MCAN_IMASK_EXT_TS_CNTR_OVFL_CLR          ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define MCAN_IMASK_EXT_TS_CNTR_OVFL_SET          ((uint32_t)0x00000010U)         /* !< Set Interrrupt Mask */
/* MCAN_IMASK[WAKEUP] Bits */
#define MCAN_IMASK_WAKEUP_OFS                    (5)                             /* !< WAKEUP Offset */
#define MCAN_IMASK_WAKEUP_MASK                   ((uint32_t)0x00000020U)         /* !< Clock Stop Wake Up interrupt mask. */
#define MCAN_IMASK_WAKEUP_CLR                    ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define MCAN_IMASK_WAKEUP_SET                    ((uint32_t)0x00000020U)         /* !< Set Interrrupt Mask */

/* MCAN_RIS Bits */
/* MCAN_RIS[INTL0] Bits */
#define MCAN_RIS_INTL0_OFS                       (0)                             /* !< INTL0 Offset */
#define MCAN_RIS_INTL0_MASK                      ((uint32_t)0x00000001U)         /* !< MCAN Interrupt Line 0. */
#define MCAN_RIS_INTL0_CLR                       ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define MCAN_RIS_INTL0_SET                       ((uint32_t)0x00000001U)         /* !< Interrupt occured */
/* MCAN_RIS[INTL1] Bits */
#define MCAN_RIS_INTL1_OFS                       (1)                             /* !< INTL1 Offset */
#define MCAN_RIS_INTL1_MASK                      ((uint32_t)0x00000002U)         /* !< MCAN Interrupt Line 1. */
#define MCAN_RIS_INTL1_CLR                       ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define MCAN_RIS_INTL1_SET                       ((uint32_t)0x00000002U)         /* !< Interrupt occured */
/* MCAN_RIS[SEC] Bits */
#define MCAN_RIS_SEC_OFS                         (2)                             /* !< SEC Offset */
#define MCAN_RIS_SEC_MASK                        ((uint32_t)0x00000004U)         /* !< Message RAM SEC interrupt. */
#define MCAN_RIS_SEC_CLR                         ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define MCAN_RIS_SEC_SET                         ((uint32_t)0x00000004U)         /* !< Interrupt occured */
/* MCAN_RIS[DED] Bits */
#define MCAN_RIS_DED_OFS                         (3)                             /* !< DED Offset */
#define MCAN_RIS_DED_MASK                        ((uint32_t)0x00000008U)         /* !< Message RAM DED interrupt. */
#define MCAN_RIS_DED_CLR                         ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define MCAN_RIS_DED_SET                         ((uint32_t)0x00000008U)         /* !< Interrupt occured */
/* MCAN_RIS[EXT_TS_CNTR_OVFL] Bits */
#define MCAN_RIS_EXT_TS_CNTR_OVFL_OFS            (4)                             /* !< EXT_TS_CNTR_OVFL Offset */
#define MCAN_RIS_EXT_TS_CNTR_OVFL_MASK           ((uint32_t)0x00000010U)         /* !< External Timestamp Counter Overflow
                                                                                    interrupt. */
#define MCAN_RIS_EXT_TS_CNTR_OVFL_CLR            ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define MCAN_RIS_EXT_TS_CNTR_OVFL_SET            ((uint32_t)0x00000010U)         /* !< Interrupt occured */
/* MCAN_RIS[WAKEUP] Bits */
#define MCAN_RIS_WAKEUP_OFS                      (5)                             /* !< WAKEUP Offset */
#define MCAN_RIS_WAKEUP_MASK                     ((uint32_t)0x00000020U)         /* !< Clock Stop Wake Up interrupt. */
#define MCAN_RIS_WAKEUP_CLR                      ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define MCAN_RIS_WAKEUP_SET                      ((uint32_t)0x00000020U)         /* !< Interrupt occured */

/* MCAN_MIS Bits */
/* MCAN_MIS[INTL0] Bits */
#define MCAN_MIS_INTL0_OFS                       (0)                             /* !< INTL0 Offset */
#define MCAN_MIS_INTL0_MASK                      ((uint32_t)0x00000001U)         /* !< Masked MCAN Interrupt Line 0. */
#define MCAN_MIS_INTL0_CLR                       ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define MCAN_MIS_INTL0_SET                       ((uint32_t)0x00000001U)         /* !< Interrupt occured */
/* MCAN_MIS[INTL1] Bits */
#define MCAN_MIS_INTL1_OFS                       (1)                             /* !< INTL1 Offset */
#define MCAN_MIS_INTL1_MASK                      ((uint32_t)0x00000002U)         /* !< Masked MCAN Interrupt Line 1. */
#define MCAN_MIS_INTL1_CLR                       ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define MCAN_MIS_INTL1_SET                       ((uint32_t)0x00000002U)         /* !< Interrupt occured */
/* MCAN_MIS[SEC] Bits */
#define MCAN_MIS_SEC_OFS                         (2)                             /* !< SEC Offset */
#define MCAN_MIS_SEC_MASK                        ((uint32_t)0x00000004U)         /* !< Masked Message RAM SEC interrupt. */
#define MCAN_MIS_SEC_CLR                         ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define MCAN_MIS_SEC_SET                         ((uint32_t)0x00000004U)         /* !< Interrupt occured */
/* MCAN_MIS[DED] Bits */
#define MCAN_MIS_DED_OFS                         (3)                             /* !< DED Offset */
#define MCAN_MIS_DED_MASK                        ((uint32_t)0x00000008U)         /* !< Masked Message RAM DED interrupt. */
#define MCAN_MIS_DED_CLR                         ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define MCAN_MIS_DED_SET                         ((uint32_t)0x00000008U)         /* !< Interrupt occured */
/* MCAN_MIS[EXT_TS_CNTR_OVFL] Bits */
#define MCAN_MIS_EXT_TS_CNTR_OVFL_OFS            (4)                             /* !< EXT_TS_CNTR_OVFL Offset */
#define MCAN_MIS_EXT_TS_CNTR_OVFL_MASK           ((uint32_t)0x00000010U)         /* !< Masked External Timestamp Counter
                                                                                    Overflow interrupt. */
#define MCAN_MIS_EXT_TS_CNTR_OVFL_CLR            ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define MCAN_MIS_EXT_TS_CNTR_OVFL_SET            ((uint32_t)0x00000010U)         /* !< Interrupt occured */
/* MCAN_MIS[WAKEUP] Bits */
#define MCAN_MIS_WAKEUP_OFS                      (5)                             /* !< WAKEUP Offset */
#define MCAN_MIS_WAKEUP_MASK                     ((uint32_t)0x00000020U)         /* !< Masked Clock Stop Wake Up
                                                                                    interrupt. */
#define MCAN_MIS_WAKEUP_CLR                      ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define MCAN_MIS_WAKEUP_SET                      ((uint32_t)0x00000020U)         /* !< Interrupt occured */

/* MCAN_ISET Bits */
/* MCAN_ISET[INTL0] Bits */
#define MCAN_ISET_INTL0_OFS                      (0)                             /* !< INTL0 Offset */
#define MCAN_ISET_INTL0_MASK                     ((uint32_t)0x00000001U)         /* !< Set MCAN Interrupt Line 0. */
#define MCAN_ISET_INTL0_NO_EFFECT                ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define MCAN_ISET_INTL0_SET                      ((uint32_t)0x00000001U)         /* !< Set Interrupt */
/* MCAN_ISET[INTL1] Bits */
#define MCAN_ISET_INTL1_OFS                      (1)                             /* !< INTL1 Offset */
#define MCAN_ISET_INTL1_MASK                     ((uint32_t)0x00000002U)         /* !< Set MCAN Interrupt Line 1. */
#define MCAN_ISET_INTL1_NO_EFFECT                ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define MCAN_ISET_INTL1_SET                      ((uint32_t)0x00000002U)         /* !< Set Interrupt */
/* MCAN_ISET[SEC] Bits */
#define MCAN_ISET_SEC_OFS                        (2)                             /* !< SEC Offset */
#define MCAN_ISET_SEC_MASK                       ((uint32_t)0x00000004U)         /* !< Set Message RAM SEC interrupt. */
#define MCAN_ISET_SEC_NO_EFFECT                  ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define MCAN_ISET_SEC_SET                        ((uint32_t)0x00000004U)         /* !< Set Interrupt */
/* MCAN_ISET[DED] Bits */
#define MCAN_ISET_DED_OFS                        (3)                             /* !< DED Offset */
#define MCAN_ISET_DED_MASK                       ((uint32_t)0x00000008U)         /* !< Set Message RAM DED interrupt. */
#define MCAN_ISET_DED_NO_EFFECT                  ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define MCAN_ISET_DED_SET                        ((uint32_t)0x00000008U)         /* !< Set Interrupt */
/* MCAN_ISET[EXT_TS_CNTR_OVFL] Bits */
#define MCAN_ISET_EXT_TS_CNTR_OVFL_OFS           (4)                             /* !< EXT_TS_CNTR_OVFL Offset */
#define MCAN_ISET_EXT_TS_CNTR_OVFL_MASK          ((uint32_t)0x00000010U)         /* !< Set External Timestamp Counter
                                                                                    Overflow interrupt. */
#define MCAN_ISET_EXT_TS_CNTR_OVFL_NO_EFFECT     ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define MCAN_ISET_EXT_TS_CNTR_OVFL_SET           ((uint32_t)0x00000010U)         /* !< Set Interrupt */
/* MCAN_ISET[WAKEUP] Bits */
#define MCAN_ISET_WAKEUP_OFS                     (5)                             /* !< WAKEUP Offset */
#define MCAN_ISET_WAKEUP_MASK                    ((uint32_t)0x00000020U)         /* !< Set Clock Stop Wake Up interrupt. */
#define MCAN_ISET_WAKEUP_NO_EFFECT               ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define MCAN_ISET_WAKEUP_SET                     ((uint32_t)0x00000020U)         /* !< Set Interrupt */

