zejun051019/2026-NUEDC-H-MSPM0G3507/include/core/ti/devices/msp/peripherals/hw_mcan.h
/* MCAN_TXBCR Bits */
/* MCAN_TXBCR[CR0] Bits */
#define MCAN_TXBCR_CR0_OFS                       (0)                             /* !< CR0 Offset */
#define MCAN_TXBCR_CR0_MASK                      ((uint32_t)0x00000001U)         /* !< Cancellation Request 0.   Each Tx
                                                                                    Buffer has its own Cancellation
                                                                                    Request bit. Writing a '1' will set
                                                                                    the corresponding Cancellation
                                                                                    Request bit; writing a '0' has no
                                                                                    impact. This enables the Host to set
                                                                                    cancellation requests for multiple Tx
                                                                                    Buffers with one write to TXBCR.
                                                                                    TXBCR bits are set only for those Tx
                                                                                    Buffers configured via TXBC. The bits
                                                                                    remain set until the corresponding
                                                                                    bit of TXBRP is reset.   0  No
                                                                                    cancellation pending   1
                                                                                    Cancellation pending   Qualified
                                                                                    Write is possible only with
                                                                                    CCCR.CCE='0' */
/* MCAN_TXBCR[CR1] Bits */
#define MCAN_TXBCR_CR1_OFS                       (1)                             /* !< CR1 Offset */
#define MCAN_TXBCR_CR1_MASK                      ((uint32_t)0x00000002U)         /* !< Cancellation Request 1. See
                                                                                    description for bit 0. */
/* MCAN_TXBCR[CR2] Bits */
#define MCAN_TXBCR_CR2_OFS                       (2)                             /* !< CR2 Offset */
#define MCAN_TXBCR_CR2_MASK                      ((uint32_t)0x00000004U)         /* !< Cancellation Request 2. See
                                                                                    description for bit 0. */
/* MCAN_TXBCR[CR3] Bits */
#define MCAN_TXBCR_CR3_OFS                       (3)                             /* !< CR3 Offset */
#define MCAN_TXBCR_CR3_MASK                      ((uint32_t)0x00000008U)         /* !< Cancellation Request 3. See
                                                                                    description for bit 0. */
/* MCAN_TXBCR[CR4] Bits */
#define MCAN_TXBCR_CR4_OFS                       (4)                             /* !< CR4 Offset */
#define MCAN_TXBCR_CR4_MASK                      ((uint32_t)0x00000010U)         /* !< Cancellation Request 4. See
                                                                                    description for bit 0. */
/* MCAN_TXBCR[CR5] Bits */
#define MCAN_TXBCR_CR5_OFS                       (5)                             /* !< CR5 Offset */
#define MCAN_TXBCR_CR5_MASK                      ((uint32_t)0x00000020U)         /* !< Cancellation Request 5. See
                                                                                    description for bit 0. */
/* MCAN_TXBCR[CR6] Bits */
#define MCAN_TXBCR_CR6_OFS                       (6)                             /* !< CR6 Offset */
#define MCAN_TXBCR_CR6_MASK                      ((uint32_t)0x00000040U)         /* !< Cancellation Request 6. See
                                                                                    description for bit 0. */
/* MCAN_TXBCR[CR7] Bits */
#define MCAN_TXBCR_CR7_OFS                       (7)                             /* !< CR7 Offset */
#define MCAN_TXBCR_CR7_MASK                      ((uint32_t)0x00000080U)         /* !< Cancellation Request 7. See
                                                                                    description for bit 0. */
/* MCAN_TXBCR[CR8] Bits */
#define MCAN_TXBCR_CR8_OFS                       (8)                             /* !< CR8 Offset */
#define MCAN_TXBCR_CR8_MASK                      ((uint32_t)0x00000100U)         /* !< Cancellation Request 8. See
                                                                                    description for bit 0. */
/* MCAN_TXBCR[CR9] Bits */
#define MCAN_TXBCR_CR9_OFS                       (9)                             /* !< CR9 Offset */
#define MCAN_TXBCR_CR9_MASK                      ((uint32_t)0x00000200U)         /* !< Cancellation Request 9. See
                                                                                    description for bit 0. */
/* MCAN_TXBCR[CR10] Bits */
#define MCAN_TXBCR_CR10_OFS                      (10)                            /* !< CR10 Offset */
#define MCAN_TXBCR_CR10_MASK                     ((uint32_t)0x00000400U)         /* !< Cancellation Request 10. See
                                                                                    description for bit 0. */
/* MCAN_TXBCR[CR11] Bits */
#define MCAN_TXBCR_CR11_OFS                      (11)                            /* !< CR11 Offset */
#define MCAN_TXBCR_CR11_MASK                     ((uint32_t)0x00000800U)         /* !< Cancellation Request 11. See
                                                                                    description for bit 0. */
/* MCAN_TXBCR[CR12] Bits */
#define MCAN_TXBCR_CR12_OFS                      (12)                            /* !< CR12 Offset */
#define MCAN_TXBCR_CR12_MASK                     ((uint32_t)0x00001000U)         /* !< Cancellation Request 12. See
                                                                                    description for bit 0. */
/* MCAN_TXBCR[CR13] Bits */
#define MCAN_TXBCR_CR13_OFS                      (13)                            /* !< CR13 Offset */
#define MCAN_TXBCR_CR13_MASK                     ((uint32_t)0x00002000U)         /* !< Cancellation Request 13. See
                                                                                    description for bit 0. */
/* MCAN_TXBCR[CR14] Bits */
#define MCAN_TXBCR_CR14_OFS                      (14)                            /* !< CR14 Offset */
#define MCAN_TXBCR_CR14_MASK                     ((uint32_t)0x00004000U)         /* !< Cancellation Request 14. See
                                                                                    description for bit 0. */
/* MCAN_TXBCR[CR15] Bits */
#define MCAN_TXBCR_CR15_OFS                      (15)                            /* !< CR15 Offset */
#define MCAN_TXBCR_CR15_MASK                     ((uint32_t)0x00008000U)         /* !< Cancellation Request 15. See
                                                                                    description for bit 0. */
/* MCAN_TXBCR[CR16] Bits */
#define MCAN_TXBCR_CR16_OFS                      (16)                            /* !< CR16 Offset */
#define MCAN_TXBCR_CR16_MASK                     ((uint32_t)0x00010000U)         /* !< Cancellation Request 16. See
                                                                                    description for bit 0. */
/* MCAN_TXBCR[CR17] Bits */
#define MCAN_TXBCR_CR17_OFS                      (17)                            /* !< CR17 Offset */
#define MCAN_TXBCR_CR17_MASK                     ((uint32_t)0x00020000U)         /* !< Cancellation Request 17. See
                                                                                    description for bit 0. */
/* MCAN_TXBCR[CR18] Bits */
#define MCAN_TXBCR_CR18_OFS                      (18)                            /* !< CR18 Offset */
#define MCAN_TXBCR_CR18_MASK                     ((uint32_t)0x00040000U)         /* !< Cancellation Request 18. See
                                                                                    description for bit 0. */
/* MCAN_TXBCR[CR19] Bits */
#define MCAN_TXBCR_CR19_OFS                      (19)                            /* !< CR19 Offset */
#define MCAN_TXBCR_CR19_MASK                     ((uint32_t)0x00080000U)         /* !< Cancellation Request 19. See
                                                                                    description for bit 0. */
/* MCAN_TXBCR[CR20] Bits */
#define MCAN_TXBCR_CR20_OFS                      (20)                            /* !< CR20 Offset */
#define MCAN_TXBCR_CR20_MASK                     ((uint32_t)0x00100000U)         /* !< Cancellation Request 20. See
                                                                                    description for bit 0. */
/* MCAN_TXBCR[CR21] Bits */
#define MCAN_TXBCR_CR21_OFS                      (21)                            /* !< CR21 Offset */
#define MCAN_TXBCR_CR21_MASK                     ((uint32_t)0x00200000U)         /* !< Cancellation Request 21. See
                                                                                    description for bit 0. */
/* MCAN_TXBCR[CR22] Bits */
#define MCAN_TXBCR_CR22_OFS                      (22)                            /* !< CR22 Offset */
#define MCAN_TXBCR_CR22_MASK                     ((uint32_t)0x00400000U)         /* !< Cancellation Request 22. See
                                                                                    description for bit 0. */
/* MCAN_TXBCR[CR23] Bits */
#define MCAN_TXBCR_CR23_OFS                      (23)                            /* !< CR23 Offset */
#define MCAN_TXBCR_CR23_MASK                     ((uint32_t)0x00800000U)         /* !< Cancellation Request 23. See
                                                                                    description for bit 0. */
/* MCAN_TXBCR[CR24] Bits */
#define MCAN_TXBCR_CR24_OFS                      (24)                            /* !< CR24 Offset */
#define MCAN_TXBCR_CR24_MASK                     ((uint32_t)0x01000000U)         /* !< Cancellation Request 24. See
                                                                                    description for bit 0. */
/* MCAN_TXBCR[CR25] Bits */
#define MCAN_TXBCR_CR25_OFS                      (25)                            /* !< CR25 Offset */
#define MCAN_TXBCR_CR25_MASK                     ((uint32_t)0x02000000U)         /* !< Cancellation Request 25. See
                                                                                    description for bit 0. */
/* MCAN_TXBCR[CR26] Bits */
#define MCAN_TXBCR_CR26_OFS                      (26)                            /* !< CR26 Offset */
#define MCAN_TXBCR_CR26_MASK                     ((uint32_t)0x04000000U)         /* !< Cancellation Request 26. See
                                                                                    description for bit 0. */
/* MCAN_TXBCR[CR27] Bits */
#define MCAN_TXBCR_CR27_OFS                      (27)                            /* !< CR27 Offset */
#define MCAN_TXBCR_CR27_MASK                     ((uint32_t)0x08000000U)         /* !< Cancellation Request 27. See
                                                                                    description for bit 0. */
/* MCAN_TXBCR[CR28] Bits */
#define MCAN_TXBCR_CR28_OFS                      (28)                            /* !< CR28 Offset */
#define MCAN_TXBCR_CR28_MASK                     ((uint32_t)0x10000000U)         /* !< Cancellation Request 28. See
                                                                                    description for bit 0. */
/* MCAN_TXBCR[CR29] Bits */
#define MCAN_TXBCR_CR29_OFS                      (29)                            /* !< CR29 Offset */
#define MCAN_TXBCR_CR29_MASK                     ((uint32_t)0x20000000U)         /* !< Cancellation Request 29. See
                                                                                    description for bit 0. */
/* MCAN_TXBCR[CR30] Bits */
#define MCAN_TXBCR_CR30_OFS                      (30)                            /* !< CR30 Offset */
#define MCAN_TXBCR_CR30_MASK                     ((uint32_t)0x40000000U)         /* !< Cancellation Request 30. See
                                                                                    description for bit 0. */
/* MCAN_TXBCR[CR31] Bits */
#define MCAN_TXBCR_CR31_OFS                      (31)                            /* !< CR31 Offset */
#define MCAN_TXBCR_CR31_MASK                     ((uint32_t)0x80000000U)         /* !< Cancellation Request 31. See
                                                                                    description for bit 0. */

