zejun051019/2026-NUEDC-H-MSPM0G3507/include/core/ti/devices/msp/peripherals/hw_mcan.h
/* MCAN_TXEFA Bits */
/* MCAN_TXEFA[EFAI] Bits */
#define MCAN_TXEFA_EFAI_OFS                      (0)                             /* !< EFAI Offset */
#define MCAN_TXEFA_EFAI_MASK                     ((uint32_t)0x0000001FU)         /* !< Event FIFO Acknowledge Index. After
                                                                                    the Host has read an element or a
                                                                                    sequence of elements from the Tx
                                                                                    Event FIFO it has to write the index
                                                                                    of the last element read from Tx
                                                                                    Event FIFO to EFAI. This will set the
                                                                                    Tx Event FIFO Get Index TXEFS.EFGI to
                                                                                    EFAI + 1 and update the Event FIFO
                                                                                    Fill Level TXEFS.EFFL. */

/* MCAN_PWREN Bits */
/* MCAN_PWREN[ENABLE] Bits */
#define MCAN_PWREN_ENABLE_OFS                    (0)                             /* !< ENABLE Offset */
#define MCAN_PWREN_ENABLE_MASK                   ((uint32_t)0x00000001U)         /* !< Enable the power */
#define MCAN_PWREN_ENABLE_DISABLE                ((uint32_t)0x00000000U)         /* !< Disable Power */
#define MCAN_PWREN_ENABLE_ENABLE                 ((uint32_t)0x00000001U)         /* !< Enable Power */
/* MCAN_PWREN[KEY] Bits */
#define MCAN_PWREN_KEY_OFS                       (24)                            /* !< KEY Offset */
#define MCAN_PWREN_KEY_MASK                      ((uint32_t)0xFF000000U)         /* !< KEY to allow Power State Change */
#define MCAN_PWREN_KEY_UNLOCK_W                  ((uint32_t)0x26000000U)         /* !< KEY to allow write access to this
                                                                                    register */

/* MCAN_RSTCTL Bits */
/* MCAN_RSTCTL[RESETSTKYCLR] Bits */
#define MCAN_RSTCTL_RESETSTKYCLR_OFS             (1)                             /* !< RESETSTKYCLR Offset */
#define MCAN_RSTCTL_RESETSTKYCLR_MASK            ((uint32_t)0x00000002U)         /* !< Clear the RESETSTKY bit in the STAT
                                                                                    register */
#define MCAN_RSTCTL_RESETSTKYCLR_NOP             ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define MCAN_RSTCTL_RESETSTKYCLR_CLR             ((uint32_t)0x00000002U)         /* !< Clear reset sticky bit */
/* MCAN_RSTCTL[RESETASSERT] Bits */
#define MCAN_RSTCTL_RESETASSERT_OFS              (0)                             /* !< RESETASSERT Offset */
#define MCAN_RSTCTL_RESETASSERT_MASK             ((uint32_t)0x00000001U)         /* !< Assert reset to the peripheral */
#define MCAN_RSTCTL_RESETASSERT_NOP              ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define MCAN_RSTCTL_RESETASSERT_ASSERT           ((uint32_t)0x00000001U)         /* !< Assert reset */
/* MCAN_RSTCTL[KEY] Bits */
#define MCAN_RSTCTL_KEY_OFS                      (24)                            /* !< KEY Offset */
#define MCAN_RSTCTL_KEY_MASK                     ((uint32_t)0xFF000000U)         /* !< Unlock key */
#define MCAN_RSTCTL_KEY_UNLOCK_W                 ((uint32_t)0xB1000000U)         /* !< KEY to allow write access to this
                                                                                    register */

/* MCAN_STAT Bits */
/* MCAN_STAT[RESETSTKY] Bits */
#define MCAN_STAT_RESETSTKY_OFS                  (16)                            /* !< RESETSTKY Offset */
#define MCAN_STAT_RESETSTKY_MASK                 ((uint32_t)0x00010000U)         /* !< This bit indicates, if the
                                                                                    peripheral was reset, since this bit
                                                                                    was cleared by RESETSTKYCLR in the
                                                                                    RSTCTL register */
#define MCAN_STAT_RESETSTKY_NORES                ((uint32_t)0x00000000U)         /* !< The peripheral has not been reset
                                                                                    since this bit was last cleared by
                                                                                    RESETSTKYCLR in the RSTCTL register */
#define MCAN_STAT_RESETSTKY_RESET                ((uint32_t)0x00010000U)         /* !< The peripheral was reset since the
                                                                                    last bit clear */


#ifdef __cplusplus
}
#endif

#endif /* ti_devices_msp_peripherals_hw_mcan__include */
